Repository: AliJimi/we_dont_pay_much
Catalog: lib/l10n/app_*.arb
Languages: ar, fa

# transferTypeLabel
source: Transfer type
ar: نوع خدمة التحويل
fa: نوع خدمت انتقال

# transferTypeCardToCard
source: Shetabi card-to-card
ar: تحويل شبكي من بطاقة إلى بطاقة / شباً
fa: انتقال شتابی کارت به کارت / کارت به شبا

# transferTypePayaIndividual
source: Paya – individual
ar: تحويل بايا - فردي
fa: پایا - انفرادی و شخصی

# transferTypePayaGroup
source: Paya – group
ar: تحويل بايا - جماعي
fa: پایا - گروهی

# transferTypeSatna
source: Satna
ar: ساتنا
fa: ساتنا

# transferTypePol
source: Pol (bridge transfer)
ar: تحويل بطريقة بول (الجسر)
fa: انتقال به شیوهٔ پل

# feeConfigLoading
source: Loading transfer fee rules...
ar: جاري تحميل رسوم التحويل...
fa: در حال دریافت آخرین کارمزدهای انتقال...

# feeConfigError
source: Unable to load fee rules. Please try again.
ar: تعذر تحميل رسوم التحويل. حاول مرة أخرى.
fa: امکان دریافت کارمزدها نیست. لطفاً دوباره تلاش کنید.

# errorConfigNotLoaded
source: Fee rules are not loaded yet. Please try again in a moment.
ar: لم يتم تحميل بيانات الرسوم بعد. حاول بعد قليل.
fa: اطلاعات کارمزد هنوز بارگذاری نشده است. چند لحظه بعد دوباره تلاش کنید.

# errorNoTransferType
source: Please choose a transfer type.
ar: يرجى اختيار نوع خدمة التحويل.
fa: لطفاً نوع خدمت انتقال را انتخاب کنید.

# errorAmountOutOfRange
source: Amount must be between {min} and {max}.
ar: يجب أن يكون المبلغ بين {min} و {max}.
fa: مبلغ باید بین {min} و {max} باشد.

# resultInterestLabel
source: Interest / fee amount
ar: قيمة الفائدة / الرسوم
fa: مبلغ سود / کارمزد

# currencySettingsTitle
source: Currency
ar: العملة
fa: واحد پول

# currencyRialOnly
source: Rial only
ar: ريال فقط
fa: فقط ریال

# currencyTomanOnly
source: Toman only
ar: تومان فقط
fa: فقط تومان

# currencyRialAndToman
source: Rial & Toman
ar: ريال و تومان
fa: ریال و تومان

# currencyRialLabel
source: Rial
ar: ريال
fa: ریال

# currencyTomanLabel
source: Toman
ar: تومان
fa: تومان

# appTitle
source: Interest Transfer Calculator
ar: حاسبة رسوم التحويل
fa: محاسبه‌گر کارمزد انتقال

# navCalculator
source: Calculator
ar: الحاسبة
fa: محاسبه

# navBankApps
source: Bank apps
ar: تطبيقات البنوك
fa: اپ‌های بانکی

# navSettings
source: Settings
ar: الإعدادات
fa: تنظیمات

# calculatorTitle
source: Interest calculator
ar: حاسبة الفائدة والرسوم
fa: محاسبه‌گر سود و کارمزد

# calculatorDescription
source: Quickly compute how much you send or receive when transfer interest or fees are added or removed.
ar: احسب المبلغ الأساسي أو المبلغ النهائي عند إضافة أو خصم الفائدة والرسوم.
fa: مبلغ نهایی یا مبلغ پایه‌ی انتقال پول را با درنظرگرفتن سود و کارمزد محاسبه کنید.

# amountLabelBase
source: Base amount
ar: المبلغ الأساسي
fa: مبلغ پایه

# amountLabelTotal
source: Total amount (with interest)
ar: المبلغ النهائي (مع الفائدة)
fa: مبلغ نهایی (با کارمزد)

# amountHint
source: Enter amount
ar: أدخل المبلغ
fa: مبلغ را وارد کنید

# interestRateLabel
source: Interest / fee (%)
ar: نسبة الفائدة / الرسوم (%)
fa: درصد سود / کارمزد

# interestRateHint
source: e.g. 2.5
ar: مثال: 2.5
fa: مثلاً ۲.۵

# calculationModeTitle
source: Calculation mode
ar: وضع الحسبة
fa: نوع محاسبه

# modeAddInterestTitle
source: Add interest to base
ar: إضافة الفائدة إلى المبلغ الأساسي
fa: افزودن کارمزد به مبلغ پایه

# modeAddInterestSubtitle
source: You know the base amount and want the final total.
ar: تعرف المبلغ الأساسي وتريد معرفة المبلغ النهائي.
fa: مبلغ پایه را می‌دانید و می‌خواهید مبلغ نهایی را حساب کنید.

# modeRemoveInterestTitle
source: Remove interest from total
ar: خصم الفائدة من المبلغ النهائي
fa: حذف کارمزد از مبلغ نهایی

# modeRemoveInterestSubtitle
source: You know the final total and want the base amount.
ar: تعرف المبلغ النهائي وتريد معرفة المبلغ الأساسي.
fa: مبلغ نهایی را می‌دانید و می‌خواهید مبلغ پایه را حساب کنید.

# calculateButton
source: Calculate
ar: احسب
fa: محاسبه

# resultTitle
source: Result
ar: النتيجة
fa: نتیجه

# resultTotalLabel
source: Total with interest
ar: المبلغ النهائي مع الفائدة
fa: مبلغ نهایی با کارمزد

# resultBaseLabel
source: Base amount (without interest)
ar: المبلغ الأساسي بدون فائدة
fa: مبلغ پایه بدون کارمزد

# errorInvalidNumber
source: Please enter valid numbers for amount and interest rate.
ar: يرجى إدخال أرقام صحيحة للمبلغ ونسبة الفائدة.
fa: لطفاً مبلغ و درصد را به‌درستی وارد کنید.

# bankScannerTitle
source: Installed bank apps
ar: تطبيقات البنوك المثبتة
fa: اپ‌های بانکی نصب‌شده

# bankScannerDescription
source: Scan your device for installed mobile banking and payment apps.
ar: افحص الجهاز للعثور على تطبيقات البنوك والدفع.
fa: دستگاه را برای پیدا کردن اپ‌های بانکی و پرداخت اسکن کنید.

# scanButton
source: Scan now
ar: فحص الآن
fa: اسکن

# installedBankAppsTitle
source: Detected apps
ar: التطبيقات المكتشفة
fa: اپ‌های شناسایی‌شده

# noBankAppsFound
source: No banking apps detected on this device.
ar: لم يتم العثور على أي تطبيقات بنكية على هذا الجهاز.
fa: هیچ اپ بانکی‌ای روی این دستگاه پیدا نشد.

# scanningInProgress
source: Scanning installed apps...
ar: جارٍ فحص التطبيقات المثبتة...
fa: در حال اسکن اپ‌های نصب‌شده...

# platformNotSupported
source: Bank app scanning is only available on Android devices.
ar: فحص تطبيقات البنوك متوفر فقط على أجهزة أندرويد.
fa: اسکن اپ‌های بانکی فقط روی دستگاه‌های اندروید فعال است.

# settingsTitle
source: App settings
ar: إعدادات التطبيق
fa: تنظیمات برنامه

# themeSectionTitle
source: Theme
ar: المظهر
fa: پوسته

# themeSystem
source: Use system theme
ar: مثل مظهر النظام
fa: همان پوستهٔ سیستم

# themeLight
source: Light
ar: فاتح
fa: روشن

# themeDark
source: Dark
ar: داكن
fa: تیره

# languageSectionTitle
source: Language
ar: اللغة
fa: زبان

# languageEnglish
source: English
ar: الإنجليزية
fa: انگلیسی

# languagePersian
source: Persian (Farsi)
ar: الفارسية
fa: فارسی

# languageArabic
source: Arabic
ar: العربية
fa: عربی

# okButton
source: OK
ar: موافق
fa: باشه

# cancelButton
source: Cancel
ar: إلغاء
fa: انصراف
